Revit 2027 API
IFCFileWriteOptions.FileFormat Property
 The file format of the IFC file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCFileFormat FileFormat { get; set; }
Public Property FileFormat As IFCFileFormat
	Get
	Set
public:
property IFCFileFormat FileFormat {
	IFCFileFormat get ();
	void set (IFCFileFormat value);
}
member FileFormat : IFCFileFormat with get, set
Property Value
IFCFileFormat
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace